@extends('layouts.app')

@section('title')
Клієнтам
@endsection

@section('content')
<div class="block-info">
    <div class="container">
        <nav aria-label="breadcrumb">
            <ol class="breadcrumb">
                <li class="breadcrumb-item"><a href="#">Головна сторінка</a></li>
                <li class="breadcrumb-item active" aria-current="page">Клієнтам</li>
            </ol>
        </nav>
    </div>
</div>
<div class="main customer">
    <div class="section-info customer">
        <div class="container">
            <h2 class="title-section-2 title-section">Клієнтам</h2>
            <div class="block-top-info align-items-center">
                <div class="img-block p-0">
                    <img src="{{ asset('./images/img-customer.svg') }}" alt="photo-product" class="img">
                </div>
                <div>
                    <h3 class="title text-center text-md-left ">Графік роботи</h3>
                    <div class="d-md-flex text-center text-md-left">
                        <ul class="list-timetable">
                            <li><span class="strong-text"> 31 жовтня – 1 березня</span></li>
                            <li> Понеділок – 10:00 – 17:00</li>
                            <li>Вівторок – 10:00-18:00</li>
                            <li>Середа – 10:00-18:00</li>
                            <li>Четвер – 10:00-18:00</li>
                            <li>П’ятниця – 10:00-18:00</li>
                            <li>Субота  - 11:00 – 17:00</li>
                        </ul>
                        <ul class="list-timetable">
                            <li><span class="strong-text">31 жовтня – 1 березня</span></li>
                            <li> Понеділок – 10:00 – 17:00</li>
                            <li>Вівторок – 10:00-18:00</li>
                            <li>Середа – 10:00-18:00</li>
                            <li>Четвер – 10:00-18:00</li>
                            <li>П’ятниця – 10:00-18:00</li>
                            <li>Субота  - 11:00 – 17:00</li>
                        </ul>
                    </div>
                </div>
            </div>
            <h3 class="title">ГАРАНТІЯ</h3>
            <p>
                В разі несправності товару або виявлення виробничих дефектів, покупець має право звернутися в наш магазин з вимогами про повернення товару, обміні, або усунення несправностей і дефектів.
                Для того щоб зробити повернення грошей, достатньо зв'язатися з нашим менеджером зі збуту, пояснити проблему, слідувати його інструкціям.
            </p>
            <p>
                Ви має право на обмін товару належної якості протягом 14 днів не рахуючи дня покупки.
                Обмін товару належної якості проводиться, якщо він не був використаний і якщо збережено його товарний вигляд, споживчі властивості, товарний або касовий чек або інші документи, видані споживачеві разом з проданим товаром.
            </p>
            <h3 class="title"> Якщо на момент обміну, аналогічного товару немає у продажу, споживач має право:</h3>
        </div>
    </div>
    <div class="section-info customer">
        <div class="container">
            <ul class="list-decor-arrow">
                <li>
                    Придбати будь-які інші товари з наявного асортименту з відповідним перерахуванням вартості
                </li>
                <li>
                    Отримати назад гроші у розмірі вартості повернутого товару
                </li>
                <li>
                    Здійснити обмін товару на аналогічний при першому ж надходженні відповідного товару в продаж
                </li>
            </ul>
            <p>Ми в свою чергу зобов'язані в день надходження товару в продаж повідомити про це споживача, який вимагає обміну товару.</p>
            <h3 class="title">Отже, в разі якщо ви зіткнулися з нижчепереліченими проблемами:</h3>
            <ul class="list-decor-arrow">
                <li>
                    Виробничий дефект товару
                </li>
                <li>
                    Невідповідність товару заявленому опису та характеристикам
                </li>
                <li>
                    Якщо товар не підійшов за формою, габаритами, фасоном, кольором, розміром або з інших причин не може бути використаний за призначенням
                </li>
            </ul>
            <h3 class="title">ВАМ НЕОБХІДНО: </h3>
            <ol>
                <li>Зв'язатися з нашим менеджером зі збуту, повідомити номер карти (в разі відсутності карти, номер гарантійного талона), пред'явити претензію на товар.</li>
                <li>Вислати нам предмет претензії на експертизу</li>
                <li>Протягом 5 робочих днів, з Вами зв'яжеться наш менеджер з продажу, з підтвердженням факту гарантійного випадку.</li>
                <li>У разі підтвердження, протягом 14 робочих днів ми надішлемо новий товар або повернемо гроші.</li>
            </ol>
        </div>
    </div>
</div>
@endsection
